Revit 2024 API
ImageType.GetImage Method
Get the bitmap image stored in the image symbol.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public Bitmap GetImage()
Visual Basic
Public Function GetImage As Bitmap
Visual C++
public:
Bitmap^ GetImage()
Return Value
The bitmap image at the original loaded image size.
See Also
ImageType Class
Autodesk.Revit.DB Namespace